{
    "rcNews":{
        "selectTitle":"RC Info",
        "title":"Runner's Catalogue Info & News",
        "updatePlans":{
            "selectTitle":"Future?",
            "title":"The future of Runner's Catalogue",
            "contents":[
                "Hey everyone!<br />I know the game may look a bit bare-bones right now, and thats because you're likely one of the first few people to play it! Thank you for giving this odd project of mine a shot.<br /><br />As for what the future of this game holds, I'm likely going to continue to add more features and polish up some stuff that's already in the game, but that likely won't last forever. Once this game is done, it's done.<br /><br />Though, that doesn't mean it will be completely done.<br />A main idea of this game is to have it be sort of community-ran. The 'submission form' feature will be expanded on in the future to allow for more stuff to be 'submitted' and added to the game. This will never stop.",
                "So what am I planning on adding?<br />Sometime soon, I'd like to add some audio logs (think documents but read aloud), as well as more written documents and features for the written documents. I may also allow other people to publish their own documents later on, so if you'd like a paper you've written in the game, don't hesitate to contact me.",
                "After I finish up that, I'm planning on adding some more features to the game selection page.<br />The games list will have a searchbar, as well as tags, to help you find games with certain characteristics that you may enjoy. As well as that, I'd also like to add some sort of 'user reviews' in some form. It could be done in several ways, and I'm currently thinking of making it either a star rating, written reviews, or both.",
                "Thank you for your support, and I hope to see more from the community in the future."
            ],
            "footer":"MagpieTaxi, 7/26/2025"
        }
    },
    "parkourHistory":{
        "selectTitle":"History",
        "title":"Parkour History",
        "genreHistory":{
            "selectTitle":"Genre History",
            "title":"The History of Parkour on Roblox",
            "contents":[
                "Parkour as a genre on Roblox has a massive history, starting in ~2016 and lasting all the way to today.<br /><br />It all starts with the release of Mirror's Edge, in 2008. This game was one of the first to feature Parkour and movement as we know it today as its main theme. It laid out the groundwork for many staples of the genre we know today. It was the game that inspired most early parkour games on Roblox.",
                "The main Roblox game that really started and popularized the genre is PARKOUR Legacy. It was made in 2016, and truly defined most of the ideas that we use to think about parkour. Legacy was the game that introduced the Grappler, Wallrun dashing, the Charge mechanic, and wallkicking.<br /><br />In 2019, in the 1.44 update, Legacy added the Grappler. Upon use, it would shoot out a rope that would pull you towards the surface the rope is attached to. This gear would go on to become the most common gear implemented in Parkour games.<br /><br />Grappler was not commonly used until version 1.74, when Wallrun Dashing was implemented. performing a wallrun and then immediately jumping out of it would multiply horizontal velocity. When this was discovered, it completely changed the meta of the game to favor it. Prior to this, the gameplay was much slower and more grounded. People would rarely ever exceed regular running speed. After wallrun dashing, common gameplay was using it to go as fast as possible. This turned the game from a casual mirror's edge clone, to something entirely distinct.",
                "After wallrun dashing, the face of 'Parkour' as a genre completely changed. It became a high-skill, competitive game based on going as fast as possible. The usage of time trials was heavily reinforced, and continues to keep the genre alive today."
            ],
            "footer":"MagpieTaxi, 7/26/2025"
        }
    }
}